In [1]:
import pandas as pd
import numpy as np

In [2]:
Roll=[1,2,3,4,5,6]
Names=["Tanmay","Diksha","Nikita","Krishna","Ananya","Khayati"]

In [3]:
df=pd.DataFrame(Roll)

df

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [47]:
df['Names']=pd.Series(Names)

In [48]:
df

   Roll Number    Names
0            1   Tanmay
1            2   Diksha
2            3   Nikita
3            4  Krishna
4            5   Ananya
5            6  Khayati

In [49]:
data= {'Name':['Freya', 'Mohak'],'Age':[9,10],'Gender':['F','M']}
df1 = pd.DataFrame(data)
df1['Marks']=pd.Series([89,79])
print (df1)

    Name  Age Gender  Marks
0  Freya    9      F     89
1  Mohak   10      M     79

In [50]:
#If we have multiple dictionaries with us then each dictionary is represented as a different row

data1 = [{'x': 1, 'y': 2},{'x': 5, 'y': 4, 'z': 5}]
df2=pd.DataFrame(data1)
df2

   x  y    z
0  1  2  NaN
1  5  4  5.0

In [51]:
#if we have only one dictionary then all the keys are differnt columns 

d1 ={'one'  pd.Series([1, 2, 3], index=['a', 'b', 'c']),'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}
df3=pd.DataFrame(d1)
df3

SyntaxError: invalid syntax (<ipython-input-51-a6f6e1cf5f65>, line 3)

In [52]:
df4=pd.read_table('Data1.txt', delim_whitespace=True,names=('A', 'B', 'C'))
df4

   A  B      C
0  1  1  12.92
1  1  2  90.75
2  1  3  60.90
3  2  1  71.34

In [53]:
df4['Total']=df4['A']+df4['B']+df4['C']
df4

   A  B      C  Total
0  1  1  12.92  14.92
1  1  2  90.75  93.75
2  1  3  60.90  64.90
3  2  1  71.34  74.34

In [54]:
import pandas as pd

In [55]:
Roll=[1,2,3,4,5,6]
Names=["Tanmay","Diksha","Nikita","Krishna","Ananya","Khayati"]
df=pd.DataFrame(Roll)
df

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [56]:
df.columns=['Roll']
df['Names']=pd.Series(Names)
#df.sort_values('Roll',ascending=False)
df

   Roll    Names
0     1   Tanmay
1     2   Diksha
2     3   Nikita
3     4  Krishna
4     5   Ananya
5     6  Khayati

In [57]:
df

   Roll    Names
0     1   Tanmay
1     2   Diksha
2     3   Nikita
3     4  Krishna
4     5   Ananya
5     6  Khayati

In [58]:
df['Marks from']=100
df

   Roll    Names  Marks from
0     1   Tanmay         100
1     2   Diksha         100
2     3   Nikita         100
3     4  Krishna         100
4     5   Ananya         100
5     6  Khayati         100

In [59]:
df['Marks1']=pd.Series([78,85,96,87,69,85])

In [60]:
df

   Roll    Names  Marks from  Marks1
0     1   Tanmay         100      78
1     2   Diksha         100      85
2     3   Nikita         100      96
3     4  Krishna         100      87
4     5   Ananya         100      69
5     6  Khayati         100      85

In [61]:
df['Marks2']=pd.Series([96,95,86,95,89,90])

In [62]:
df

   Roll    Names  Marks from  Marks1  Marks2
0     1   Tanmay         100      78      96
1     2   Diksha         100      85      95
2     3   Nikita         100      96      86
3     4  Krishna         100      87      95
4     5   Ananya         100      69      89
5     6  Khayati         100      85      90

In [63]:
df['Aggregate']=(df['Marks1']+df['Marks2'])/2
df

   Roll    Names  Marks from  Marks1  Marks2  Aggregate
0     1   Tanmay         100      78      96       87.0
1     2   Diksha         100      85      95       90.0
2     3   Nikita         100      96      86       91.0
3     4  Krishna         100      87      95       91.0
4     5   Ananya         100      69      89       79.0
5     6  Khayati         100      85      90       87.5

In [64]:
df.to_csv(r'C:\Users\pulki\Desktop\Result.csv',index=False,header=True)

In [23]:
d={'roll':[1,2,3,4,5,6],'names':["Tanmay","Diksha","Nikita","Krishna","Ananya","Khayati"],'Marks from':100,'Marks1':[78,85,96,87,69,85],'Marks2':[96,95,86,95,89,90]}
df1=pd.DataFrame(d)
df1

   roll    names  Marks from  Marks1  Marks2
0     1   Tanmay         100      78      96
1     2   Diksha         100      85      95
2     3   Nikita         100      96      86
3     4  Krishna         100      87      95
4     5   Ananya         100      69      89
5     6  Khayati         100      85      90

In [25]:
df1['Aggregate']=(df1['Marks1']+df1['Marks2'])/2
df1

   roll    names  Marks from  Marks1  Marks2  Aggregate
0     1   Tanmay         100      78      96       87.0
1     2   Diksha         100      85      95       90.0
2     3   Nikita         100      96      86       91.0
3     4  Krishna         100      87      95       91.0
4     5   Ananya         100      69      89       79.0
5     6  Khayati         100      85      90       87.5

In [10]:
import pandas as pd
df.sort_values(by='Marks1',ascending=False)
df

NameError: name 'df' is not defined

In [3]:
import pandas as pd
df2=pd.read_table('dataforframe.txt', delim_whitespace=True,names=('Sno', 'Country', 'Year', 'Value' ))
df2

   Sno Country  Year  Value
0    1   India  2005      6
1    2   India  2005     13
2    3   India  2005     10
3    4   India  2005     11
4    5   India  2005      5
5    1   India  2006      3
6    2   India  2006      2
7    3   India  2006      7
8    4   India  2006      3
9    5   India  2006      6

In [32]:
import pandas as pd
df10=pd.read_csv("MyCSV.csv")
df10

         Date   price  Product    Company
0  23/04/2020  2000.0  Shampoo   Bodyshop
1  24/04/2020  1200.0   Sweets   Haldiram
2  25/04/2020     NaN     Food  BigBazaar

In [33]:
df10.shape

(3, 4)

In [8]:
df10.head(1)

         Date  price  Product   Company
0  23/04/2020   2000  Shampoo  Bodyshop

In [9]:
df10.tail(1)

         Date  price Product   Company
1  24/04/2020   1200  Sweets  Haldiram

In [11]:
df10.pop('Company')

0    Bodyshop
1    Haldiram
Name: Company, dtype: object

In [12]:
df10

         Date  price  Product
0  23/04/2020   2000  Shampoo
1  24/04/2020   1200   Sweets

In [29]:
import pandas as pd
import numpy as np
raw_data1 = {'name': ['freya', 'mohak','ram'],'age': [10, 1, 12],'favorite_color': ['pink', 'blue','green'],'grade': [88, 92, 95]}
df = pd.DataFrame(raw_data1, columns = ['name', 'age','favorite_color', 'grade'])
df[['name','age']]

    name  age
0  freya   10
1  mohak    1
2    ram   12

In [30]:
for index, row in df.iterrows():
    print (row["name"], row["age"])

freya 10
mohak 1
ram 12

In [34]:
df10.loc[:'price']

         Date   price  Product    Company
0  23/04/2020  2000.0  Shampoo   Bodyshop
1  24/04/2020  1200.0   Sweets   Haldiram
2  25/04/2020     NaN     Food  BigBazaar

In [37]:
left = pd.DataFrame({'id':[1,2],'Name': ['anil', 'vishal'],'subject_id':['sub1','sub2']})
right = pd.DataFrame({'id':[1,2],'Name': ['sumer', 'salil'],'subject_id':['sub2','sub4']})
left

   id    Name subject_id
0   1    anil       sub1
1   2  vishal       sub2

In [38]:
right

   id   Name subject_id
0   1  sumer       sub2
1   2  salil       sub4

In [39]:
print (pd.merge(left,right,on='id'))

   id  Name_x subject_id_x Name_y subject_id_y
0   1    anil         sub1  sumer         sub2
1   2  vishal         sub2  salil         sub4

In [40]:
print(pd.merge(left, right, on='subject_id', how='left')) #left join

   id_x  Name_x subject_id  id_y Name_y
0     1    anil       sub1   NaN    NaN
1     2  vishal       sub2   1.0  sumer

In [41]:
print(pd.merge(left, right, on='subject_id', how='right')) #right join

   id_x  Name_x subject_id  id_y Name_y
0   2.0  vishal       sub2     1  sumer
1   NaN     NaN       sub4     2  salil

In [42]:
print(pd.merge(left, right, how='outer', on='subject_id')) #outer join (UNION)

   id_x  Name_x subject_id  id_y Name_y
0   1.0    anil       sub1   NaN    NaN
1   2.0  vishal       sub2   1.0  sumer
2   NaN     NaN       sub4   2.0  salil

In [43]:
print(pd.merge(left, right, on='subject_id', how='inner')) # innerjoin (INTERSECTION)

   id_x  Name_x subject_id  id_y Name_y
0     2  vishal       sub2     1  sumer

In [1]:
import numpy as np
import pandas as pd
data = np.array([['','Col1','Col2'], ['Row1',1,2], ['Row2',3,4]])
print(data)

[['' 'Col1' 'Col2']
 ['Row1' '1' '2']
 ['Row2' '3' '4']]

In [5]:
print(pd.DataFrame(data=data[1:,1:], index=data[1:,0], columns=data[0,1:]))

     Col1 Col2
Row1    1    2
Row2    3    4

In [7]:
import pandas as pd
df=pd.read_csv("mydata.csv")
df

   Empid     Name  Age       City  Salary
0    100   Ritesh   25     Mumbai   15000
1    101   Akarsh   26        Goa   16000
2    102   Mahima   27  Hyderabad   20000
3    103  Lakshay   23      Delhi   18000
4    104     Manu   25     Mumbai   25000
5    105    Nidhi   26      Delhi   20000
6    106    Geetu   30  Bangalore   28000

In [9]:
df['Salary'].std()

4715.728494951256

In [10]:
df['Salary'].var()

22238095.23809524

In [7]:
df['Salary'].sum()

142000

In [8]:
df['Salary'].min()

15000

In [9]:
df['Salary'].max()

28000

In [10]:
df['Salary'].mean()

20285.714285714286

In [11]:
df['Salary'].mode()

0    20000
dtype: int64

In [12]:
df['Salary'].median()

20000.0

In [16]:
#Quantile
'''Quantile statistics is a part of a data set. It is used to describe data in a clear and understandable way.
The 0,30 quantile is basically saying that 30 % of the observations in our data set is below a given line.
On the other hand ,it is also stating that there are 70 % remaining above the line we set.'''

df['Salary'].quantile([0.25,0.5,0.75,1])

0.25    17000.0
0.50    20000.0
0.75    22500.0
1.00    28000.0
Name: Salary, dtype: float64

In [6]:
import pandas as pd
import numpy as np
s=pd.Series([9,2,12,4,5,7])
r=s.var()
print(r)

13.1

In [11]:
import pandas as pd
df = pd.DataFrame({'Animal': ['Tiger', 'Tiger','Parrot', 'Parrot'],'Max Speed': [180, 170, 24, 26]})
m=df.groupby(['Animal']).mean()
print(m)

        Max Speed
Animal
Parrot         25
Tiger         175

In [15]:
import pandas as pd
import numpy as np
#Create a Dictionary of series
d = {'Name':pd.Series(['Sachin','Dhoni','Virat','Rohit','Shikhar']),'Age':pd.Series([26,27,25,24,31]),'Score':pd.Series([87,89,67,55,47])}
#Create a DataFrame
df = pd.DataFrame(d)
print("Dataframe contents without sorting")
print (df)
df=df.sort_values(by=['Age','Score'],ascending=[False,True])
print("Dataframe contents after sorting")
print (df)

Dataframe contents without sorting
      Name  Age  Score
0   Sachin   26     87
1    Dhoni   27     89
2    Virat   25     67
3    Rohit   24     55
4  Shikhar   31     47
Dataframe contents after sorting
      Name  Age  Score
4  Shikhar   31     47
1    Dhoni   27     89
0   Sachin   26     87
2    Virat   25     67
3    Rohit   24     55

In [4]:
import pandas as pd
import numpy as np
#Create a Dictionary of series
d = {'Name':pd.Series(['Sachin','Dhoni','Virat','Rohit','Shikhar']),'Age':pd.Series([26,25,25,24,31]),'Score':pd.Series([87,67,89,55,47])}
#Create a DataFrame
df = pd.DataFrame(d)
#print(df)
df=df.reindex([1,4,3,2,0])
#print(df)
print("Dataframe contents without sorting")
print (df)
df1=df.sort_index(ascending=0)
print("Dataframe contents after sorting")
print (df1)

Dataframe contents without sorting
      Name  Age  Score
1    Dhoni   25     67
4  Shikhar   31     47
3    Rohit   24     55
2    Virat   25     89
0   Sachin   26     87
Dataframe contents after sorting
      Name  Age  Score
4  Shikhar   31     47
3    Rohit   24     55
2    Virat   25     89
1    Dhoni   25     67
0   Sachin   26     87

In [5]:
import pandas as pd
students = [ ('Mohak', 34, 'Sydeny') ,('Freya', 30, 'Delhi' ) ,('Rajesh', 16, 'New York') ]
# Create a DataFrame object
df = pd.DataFrame(students, columns = ['Name' , 'Age', 'City'],
index=['a', 'b', 'c'])
#Selecting a Single Row by Index label
rowData = df.loc[ 'b' , : ]
print("Select a Single Row " , rowData , sep='\n')
print("Type : " , type(rowData))

Select a Single Row
Name    Freya
Age        30
City    Delhi
Name: b, dtype: object
Type :  <class 'pandas.core.series.Series'>

In [6]:
rowData1 = df.loc[ ['c' , 'b'] , : ]
print("Select multiple Rows" , rowData1 , sep='\n')

Select multiple Rows
     Name  Age      City
c  Rajesh   16  New York
b   Freya   30     Delhi

In [7]:
subset = df.loc[ ['c' , 'b'] ,['Age', 'Name'] ]
print("Select both columns & Rows" , subset , sep='\n')

Select both columns & Rows
   Age    Name
c   16  Rajesh
b   30   Freya

In [9]:
print(" Select column at index 2 ")
print( df.iloc[ : , 2 ] )

 Select column at index 2
a      Sydeny
b       Delhi
c    New York
Name: City, dtype: object

In [10]:
print(" Select columns in column index range 0 to 2")
print(df.iloc[:, 0:2])

 Select columns in column index range 0 to 2
     Name  Age
a   Mohak   34
b   Freya   30
c  Rajesh   16

In [13]:
df = pd.DataFrame({'A': [11, 21, 31],'B': [12, 22, 32],'C': [13, 23, 33]},
index=['ONE', 'TWO', 'THREE'])
print(df)
df_new = df.rename(columns={'A': 'a'}, index={'ONE': 'one'})
print(df_new)

        A   B   C
ONE    11  12  13
TWO    21  22  23
THREE  31  32  33
        a   B   C
one    11  12  13
TWO    21  22  23
THREE  31  32  33

In [122]:
import pandas as pd
import numpy as np
table = {"ITEM":['TV','TV','AC','AC'],'COMPANY':['LG','VIDEOCON','LG','SONY'],'RUPEES':['1200','1000','1500','1400'],'USD':['700','650','800','600']}
d = pd.DataFrame(table)
print("DATA OF DATAFRAME")
print(d)
p = d.pivot(index='ITEM', columns='COMPANY', values='USD').fillna(0)
print("\n\nDATA OF PIVOT")
print(p)
print (p[p.index=='TV'].LG.values)

DATA OF DATAFRAME
  ITEM   COMPANY RUPEES  USD
0   TV        LG   1200  700
1   TV  VIDEOCON   1000  650
2   AC        LG   1500  800
3   AC      SONY   1400  600


DATA OF PIVOT
COMPANY   LG SONY VIDEOCON
ITEM
AC       800  600        0
TV       700    0      650
['700']

In [104]:
#Create a dataframe with following values
'''Indicator Country Year Value
   1         India   2005  6
   2         India   2005 13
   3         India   2005 10
   4         India   2005 11
   5         India   2005  5
   1         India   2006  3
   2         India   2006  2
   3         India   2006  7
   4         India   2006  3
   5         India   2006  6

Indicator
Country Year 1  2  3  4  5
India   2005 6 13 10 11  5
India   2006 3  2  7  3  6'''

from collections import OrderedDict
import pandas as pd
import numpy as np
d=OrderedDict((("Indicator",['1','1','2','2']),("Country",['India','India','India','India']),
               ('Year',['2005','2006','2005','2006']),('Value',('6','8','12','5'))))
df=pd.DataFrame(d)
print(df)
print (df.pivot_table(index=['Country','Year'],columns='Indicator',values='Value', aggfunc=' '.join))

  Indicator Country  Year Value
0         1   India  2005     6
1         1   India  2006     8
2         2   India  2005    12
3         2   India  2006     5
Indicator     1   2
Country Year
India   2005  6  12
        2006  8   5

In [125]:
import pandas as pd
import numpy as np
raw_data = {'name':['freya','mohak','rajesh'],'age': [42,np.nan,36 ]} 
df = pd.DataFrame(raw_data, columns = ['name','age'])
print(df)
df['age']=df['age'].fillna(0)
print(df)

     name   age
0   freya  42.0
1   mohak   NaN
2  rajesh  36.0
     name   age
0   freya  42.0
1   mohak   0.0
2  rajesh  36.0

In [127]:
import pandas as pd
import numpy as np
# reading the data
data = pd.read_csv('data.csv')
# sort the df by ascending years and descending happiness scores
data.sort_values(['Year', "Happiness Score"], ascending=[True, False], inplace=True)
#diplay first 10 rows
data.head(20)

,Unnamed: 0,Country,Region,Happiness Rank,Happiness Score,Economy (GDP per Capita),Family,Health (Life Expectancy),Freedom,Trust (Government Corruption),Generosity,Dystopia Residual,Year
141,141,Switzerland,Western Europe,1.0,7.587,1.39651,1.34951,0.94143,0.66557,0.41978,0.29678,2.51738,2015
60,60,Iceland,Western Europe,2.0,7.561,1.30232,1.40223,0.94784,0.62877,0.14145,0.43630,2.70201,2015
38,38,Denmark,Western Europe,3.0,7.527,1.32548,1.36058,0.87464,0.64938,0.48357,0.34139,2.49204,2015
108,108,Norway,Western Europe,4.0,7.522,1.45900,1.33095,0.88521,0.66973,0.36503,0.34699,2.46531,2015
25,25,Canada,North America,5.0,7.427,1.32629,1.32261,0.90563,0.63297,0.32957,0.45811,2.45176,2015
46,46,Finland,Western Europe,6.0,7.406,1.29025,1.31826,0.88911,0.64169,0.41372,0.23351,2.61955,2015
102,102,Netherlands,Western Europe,7.0,7.378,1.32944,1.28017,0.89284,0.61576,0.31814,0.47610,2.46570,2015
140,140,Sweden,Western Europe,8.0,7.364,1.33171,1.28907,0.91087,0.65980,0.43844,0.36262,2.37119,2015
103,103,New Zealand,Australia and New Zealand,9.0,7.286,1.25018,1.31967,0.90837,0.63938,0.42922,0.47501,2.26425,2015
6,6,Australia,Australia and New Zealand,10.0,7.284,1.33358,1.30923,0.93156,0.65124,0.35637,0.43562,2.26646,2015
66,66,Israel,Middle East and Northern Africa,11.0,7.278,1.22857,1.22393,0.91387,0.41319,0.07785,0.33172,3.08854,2015
34,34,Costa Rica,Latin America and Caribbean,12.0,7.226,0.95578,1.23788,0.86027,0.63376,0.10583,0.25497,3.17728,2015
7,7,Austria,Western Europe,13.0,7.200,1.33723,1.29704,0.89042,0.62433,0.18676,0.33088,2.53320,2015
93,93,Mexico,Latin America and Caribbean,14.0,7.187,1.02054,0.91451,0.81444,0.48181,0.21312,0.14074,3.60214,2015
157,157,United States,North America,15.0,7.119,1.39451,1.24711,0.86179,0.54604,0.15890,0.40105,2.51011,2015
19,19,Brazil,Latin America and Caribbean,16.0,6.983,0.98124,1.23287,0.69702,0.49049,0.17521,0.14574,3.26001,2015
84,84,Luxembourg,Western Europe,17.0,6.946,1.56391,1.21963,0.91894,0.61583,0.37798,0.28034,1.96961,2015
65,65,Ireland,Western Europe,18.0,6.940,1.33596,1.36948,0.89533,0.61777,0.28703,0.45901,1.97570,2015
12,12,Belgium,Western Europe,19.0,6.937,1.30782,1.28566,0.89667,0.58450,0.22540,0.22250,2.41484,2015
155,155,United Arab Emirates,Middle East and Northern Africa,20.0,6.901,1.42727,1.12575,0.80925,0.64157,0.38583,0.26428,2.24743,2015

In [66]:
data.describe()

,Unnamed: 0,Happiness Rank,Happiness Score,Economy (GDP per Capita),Family,Health (Life Expectancy),Freedom,Trust (Government Corruption),Generosity,Dystopia Residual,Year
count,495.000000,470.000000,470.000000,470.000000,470.000000,470.000000,470.000000,470.000000,470.000000,470.000000,495.000000
mean,247.000000,78.829787,5.370728,0.927830,0.990347,0.579968,0.402828,0.134790,0.242241,2.092717,2016.000000
std,143.038456,45.281408,1.136998,0.415584,0.318707,0.240161,0.150356,0.111313,0.131543,0.565772,0.817323
min,0.000000,1.000000,2.693000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.328580,2015.000000
25%,123.500000,40.000000,4.509000,0.605292,0.793000,0.402301,0.297615,0.059777,0.152831,1.737975,2015.000000
50%,247.000000,79.000000,5.282500,0.995439,1.025665,0.630053,0.418347,0.099502,0.223140,2.094640,2016.000000
75%,370.500000,118.000000,6.233750,1.252443,1.228745,0.768298,0.516850,0.173161,0.315824,2.455575,2017.000000
max,494.000000,158.000000,7.587000,1.870766,1.610574,1.025250,0.669730,0.551910,0.838075,3.837720,2017.000000

In [67]:
pd.pivot_table(data, index= 'Year', values= "Happiness Score")

      Happiness Score
Year
2015         5.375734
2016         5.382185
2017         5.354019

In [68]:
pd.pivot_table(data, index= 'Year')

,Dystopia Residual,Economy (GDP per Capita),Family,Freedom,Generosity,Happiness Rank,Happiness Score,Health (Life Expectancy),Trust (Government Corruption),Unnamed: 0
Year,,,,,,,,,,
2015,2.098977,0.846137,0.991046,0.428615,0.237296,79.493671,5.375734,0.630259,0.143422,82
2016,2.325807,0.953880,0.793621,0.370994,0.242635,78.980892,5.382185,0.557619,0.137624,247
2017,1.850238,0.984718,1.188898,0.408786,0.246883,78.000000,5.354019,0.551341,0.123120,412

In [98]:
pd.pivot_table(data, index= ['Country','Region'],values="Happiness Score")

                                             Happiness Score
Country     Region
Afghanistan Southern Asia                           3.576333
Albania     Central and Eastern Europe              4.752667
Algeria     Middle East and Northern Africa         5.944000
Angola      Sub-Saharan Africa                      3.898000
Argentina   Latin America and Caribbean             6.607667
...                                                      ...
Venezuela   Latin America and Caribbean             6.048000
Vietnam     Southeastern Asia                       5.165000
Yemen       Middle East and Northern Africa         3.798000
Zambia      Sub-Saharan Africa                      4.812667
Zimbabwe    Sub-Saharan Africa                      4.226000

[165 rows x 1 columns]

In [128]:
pd.pivot_table(data, index = ['Country','Region', 'Year'], values="Happiness Score")

                                             Happiness Score
Country     Region                     Year
Afghanistan Southern Asia              2015            3.575
                                       2016            3.360
                                       2017            3.794
Albania     Central and Eastern Europe 2015            4.959
                                       2016            4.655
...                                                      ...
Zambia      Sub-Saharan Africa         2016            4.795
                                       2017            4.514
Zimbabwe    Sub-Saharan Africa         2015            4.610
                                       2016            4.193
                                       2017            3.875

[470 rows x 1 columns]

In [101]:
pd.pivot_table(data, index= 'Region', columns='Year', values="Happiness Score")

Year                                 2015      2016      2017
Region
Australia and New Zealand        7.285000  7.323500  7.299000
Central and Eastern Europe       5.332931  5.370690  5.409931
Eastern Asia                     5.626167  5.624167  5.646667
Latin America and Caribbean      6.144682  6.101750  5.957818
Middle East and Northern Africa  5.406900  5.386053  5.369684
North America                    7.273000  7.254000  7.154500
Southeastern Asia                5.317444  5.338889  5.444875
Southern Asia                    4.580857  4.563286  4.628429
Sub-Saharan Africa               4.202800  4.136421  4.111949
Western Europe                   6.689619  6.685667  6.703714

In [102]:
pd.pivot_table(data, index= 'Region', values= "Happiness Score", aggfunc= [np.mean, np.median, min, max, np.std])

,mean,median,min,max,std
,Happiness Score,Happiness Score,Happiness Score,Happiness Score,Happiness Score
Region,,,,,
Australia and New Zealand,7.302500,7.2995,7.284,7.334,0.020936
Central and Eastern Europe,5.371184,5.4010,4.096,6.609,0.578274
Eastern Asia,5.632333,5.6545,4.874,6.422,0.502100
Latin America and Caribbean,6.069074,6.1265,3.603,7.226,0.728157
Middle East and Northern Africa,5.387879,5.3175,3.006,7.278,1.031656
North America,7.227167,7.2175,6.993,7.427,0.179331
Southeastern Asia,5.364077,5.2965,3.819,6.798,0.882637
Southern Asia,4.590857,4.6080,3.360,5.269,0.535978
Sub-Saharan Africa,4.150957,4.1390,2.693,5.648,0.584945
Western Europe,6.693000,6.9070,4.857,7.587,0.777886

In [2]:
from pandas import DataFrame
Employees = {'Name of Employee':
['Mohak','Vijay','Tapasi','Mansi','Bipin','Mohak','Vijay','Tapasi','Mansi','Bipin','Mohak','Vijay','Tapasi','Mansi',
'Bipin','Mohak','Vijay','Tapasi','Mansi','Bipin'], 'Sales':[1000,300,400,500,800,1000,500,700,50,60,1000,900,750,200,300,1000,900,250,750,50],
 'Quarter': [1,1,1,1,1,2,2,2,2,2,3,3,3,3,3,4,4,4,4,4],'State':['Rajasthan','Panjab','Gujarat','Goa','Rajasthan','Gujarat','Panjab','Gujarat','Rajasthan','Rajasthan','Rajasthan','Panjab','Gujarat','Goa','Gujarat','Panjab','Panjab','Gujarat','Goa','Rajasthan']
 }
df = DataFrame(Employees, columns= ['Name of Employee', 'Sales','Quarter','State'])
print (df)

   Name of Employee  Sales  Quarter      State
0             Mohak   1000        1  Rajasthan
1             Vijay    300        1     Panjab
2            Tapasi    400        1    Gujarat
3             Mansi    500        1        Goa
4             Bipin    800        1  Rajasthan
5             Mohak   1000        2    Gujarat
6             Vijay    500        2     Panjab
7            Tapasi    700        2    Gujarat
8             Mansi     50        2  Rajasthan
9             Bipin     60        2  Rajasthan
10            Mohak   1000        3  Rajasthan
11            Vijay    900        3     Panjab
12           Tapasi    750        3    Gujarat
13            Mansi    200        3        Goa
14            Bipin    300        3    Gujarat
15            Mohak   1000        4     Panjab
16            Vijay    900        4     Panjab
17           Tapasi    250        4    Gujarat
18            Mansi    750        4        Goa
19            Bipin     50        4  Rajasthan

In [3]:
'''                 Sales
Name of Employee
Bipin            1210
Mansi            1500
Mohak            4000
Tapasi           2100
Vijay            2600
'''
pivot=df.pivot_table(index="Name of Employee", values="Sales", aggfunc='sum')
print(pivot)

                  Sales
Name of Employee
Bipin              1210
Mansi              1500
Mohak              4000
Tapasi             2100
Vijay              2600

In [4]:
'''         Sales
State
Goa         1450
Gujarat     3400
Panjab      3600
Rajasthan   2960'''

pivot1=df.pivot_table(index="State", values="Sales", aggfunc='sum')
print(pivot1)

           Sales
State
Goa         1450
Gujarat     3400
Panjab      3600
Rajasthan   2960

In [5]:
'''                             Sales
Name of Employee    State
Bipin               Gujarat     300
                    Rajasthan   910
Mansi               Goa         1450
                    Rajasthan   50
Mohak               Gujarat     1000
                    Panjab      1000
                    Rajasthan   2000
Tapasi              Gujarat     2100
Vijay               Panjab      2600'''

pivot1=df.pivot_table(index=["Name of Employee","State"], values="Sales", aggfunc='sum')
print(pivot1)

                            Sales
Name of Employee State
Bipin            Gujarat      300
                 Rajasthan    910
Mansi            Goa         1450
                 Rajasthan     50
Mohak            Gujarat     1000
                 Panjab      1000
                 Rajasthan   2000
Tapasi           Gujarat     2100
Vijay            Panjab      2600

In [7]:
'''
          Sales
State
Goa       750
Gujarat   1000
Panjab    1000
Rajasthan 1000'''

pivot2=df.pivot_table(index="State", values="Sales", aggfunc='max') 
print(pivot2)

           Sales
State
Goa          750
Gujarat     1000
Panjab      1000
Rajasthan   1000

In [10]:
'''
                                      Sales
            mean       median    min
State
Goa         483.333333 500.0     200.0
Gujarat     566.666667 550.0     250.0
Panjab      720.000000 900.0     300.0
Rajasthan   493.333333 430.0     50.0

'''

pivot3=df.pivot_table(index="State", values="Sales",aggfunc={"mean","median","min"} )
print(pivot3)

                 mean  median    min
State
Goa        483.333333   500.0  200.0
Gujarat    566.666667   550.0  250.0
Panjab     720.000000   900.0  300.0
Rajasthan  493.333333   430.0   50.0

In [ ]:
'''    name   year score catches
0   Mohak  2012 10    2
1   Rajesh 2012 22    2
2   Freya  2013 11    3
3   Aditya 2014 32    3
4   Anika  2014 23    3
'''

# Create this dataframe
#Sort the dataframe’s rows by score, in descending order
#Sort the dataframe’s rows using index
#Sort the dataframe’s rows by catches and then by score, in ascending order/sort by multiple columns
#Sort the dataframe’s rows descending of index value